# 练习1：
# 在终端中显示0 1 2 3
# # while循环：初始条件：x=0  循环条件：x<4  变化条件：x+=1
# x = 0
# while x < 4:
#     print(x)
#     x += 1


# 在终端中显示2 3 4 5 6
# # while循环：初始条件：x=2  循环条件：x<7  变化条件：x+=1
# x = 2
# while x < 7:
#     print(x)
#     x += 1


# 在终端中显示1 3 5 7
# # while循环：初始条件：x=1  循环条件：x<=7  变化条件：x+=2
# x = 1
# while x <= 7:
#     print(x)
#     x += 2


# 在终端中显示8 7 6 5 4
# # while循环：初始条件：x=8  循环条件：x>3  变化条件：x-=1
# x = 8
# while x > 3:
#     print(x)
#     x -= 1


# 在终端中显示-1 -2 -3 -4 -5
# while循环：初始条件：x=-1  循环条件：x>-6  变化条件：x-=1
# x = -1
# while x > -6:
#     print(x)
#     x -= 1