"""
    练习1：使用3个Series对象表达3行数据，并打印以下数据：
    -- 标签索引定位单个元素：台湾,182,505
    -- 标签索引定位多个元素：陕西,859,1573
    -- 标签切片定位多个元素：2,505,2008
"""
from pandas import Series

ser_tw = Series(
    {
        "地区": "台湾",
        "新增": 16,
        "现有": 2339,
        "累计": 16931,
        "治愈": 13742
    }
)
ser_sx = Series(
    {
        "地区": "陕西",
        "新增": 182,
        "现有": 859,
        "累计": 1573,
        "治愈": 711
    }
)
ser_zj = Series(
    {
        "地区": "浙江",
        "新增": 2,
        "现有": 505,
        "累计": 2008,
        "治愈": 1502
    }
)
print(ser_tw["地区"])
print(ser_sx["新增"])
print(ser_zj["现有"])

print(ser_sx[["地区", "现有", "累计"]])

print(ser_zj["新增":"累计"])