# 切片
s = '我是花果山齐天大圣'

# 切片表达式 --》结果
# print(s[:])    # 复制（浅拷贝）
# print(s[2:])
# print(s[2:5])
# print(s[:5])
# print(s[-8:5])
# print(s[::3])
# print(s[::-3])
# print(s[7::-3])
# print(s[7:-8:-3])

# 结果 --》 切片表达式
# print('花齐', s[2:-3:3])
# print('大山是', s[-2:0:-3])

# 注意
# print(s[-7:6:-3])    # 方向相反    ''
# print(s[3:-6:-1])    # 起始与终止索引值重合  ''


'''
    重点
        +   +=
        in  not in   --> 数据 in/not in 容器
        容器[索引值]   --> 索引值：int   (取单个数据)
        容器[[起始索引值]:[[终止索引值]:[步长]]]   --> 索引值：int  (取多个数据)
        len(容器) --> 返回容器的长度
'''
