'''
作业3：模拟北京出租车计价器
​    1、起步价：13元（包含3公里）；
​    2、超过3公里，但没超过15公里的部分，每公里2.3元
​    3、超过15公里的部分，每公里加收2.3元的 50%
​    要求：计算并打印应付的车费，小数部分保留2位数。

分析
    1 获取一个正确的公里数
    2 公里数的判断
        0 < km <= 3: 13
        3 < km <= 15: 13 + (km - 3) * 2.3
        km > 15: 13 + 12 * 2.3 + (km - 15) * (2.3 + 2.3 * 0.5)
               3公里 + 12公里  + 15公里之外
    3 打印结果
        round(车费, 2)
'''

# # 方法1
# km = float(input('请输入公里数：'))
#
# if km > 0:
#     if km <= 3:
#         print('应付车费：', 13, '元')
#     elif 3 < km <= 15:
#         print('应付车费：', round(13 + (km - 3) * 2.3, 2), '元')
#     else:
#         print('应付车费：', round(13 + 12 * 2.3 + (km - 15) * (2.3 + 2.3 * 0.5), 2), '元')
# else:
#     print('公里数输入错误')


# # 方法2
# km = float(input('请输入公里数：'))
#
# if km > 0:
#     if km <= 3:
#         money = 13
#     elif 3 < km <= 15:
#         money = 13 + (km - 3) * 2.3
#     else:
#         money = 13 + 12 * 2.3 + (km - 15) * (2.3 + 2.3 * 0.5)
#     print('应付车费：', round(money, 2), '元')
# else:
#     print('公里数输入错误')


# 方法3
km = float(input('请输入公里数：'))

if km > 0:
    money = 13
    if 3 < km <= 15:
        money += (km - 3) * 2.3
    elif km > 15:
        money += 12 * 2.3 + (km - 15) * (2.3 + 2.3 * 0.5)
    print('应付车费：', round(money, 2), '元')
else:
    print('公里数输入错误')