# 外部函数嵌套作用域

# 全局作用域
# a = 10
# def func1():
#     # 外部函数嵌套作用域
#     # a = 100
#     def func2():
#         # 局部作用域
#         # a = 1000
#         print('局部变量:', a)  # 1000
#     func2()   # 函数调用结束后,栈帧被释放,存储的变量被销毁
#     print('外部函数嵌套变量:', a)  # 100
#
# func1()
# print('全局变量:', a) # 10



# 全局作用域
a = 10
def func1():
    # 外部函数嵌套作用域
    a = 100
    def func2():
        # 局部作用域
        # global a   # 将变量的作用域声明为全局作用域
        nonlocal a   # 将变量的作用域声明为外部函数嵌套作用域
        a = 1000
        print('局部变量:', a)  # 1000
    func2()
    print('外部函数嵌套变量:', a)  # 1000

func1()
print('全局变量:', a) # 10